---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.GenericFailures
source: html/71c7f195-008c-8281-2f59-092f47c2cbd0.htm
---
# BuiltInFailures.GenericFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.